**EXPLORATION AND CLEANING Neo_bank**

EXPLORATION Neo_bank Table USERS

In [51]:
from google.colab import auth
auth.authenticate_user()

import pandas as pd
from pandas_gbq import read_gbq

project_id = "data-analytics-bootcamp-363212"

query = """
SELECT *
FROM `data-analytics-bootcamp-363212.neo_bank.users`
"""

df_users = pd.read_gbq(query, project_id="data-analytics-bootcamp-363212")
df_users.head()

/tmp/ipython-input-347615197.py:14: FutureWarning: read_gbq is deprecated and will be removed in a future version. Please use pandas_gbq.read_gbq instead: https://pandas-gbq.readthedocs.io/en/latest/api.html#pandas_gbq.read_gbq
  df_users = pd.read_gbq(query, project_id="data-analytics-bootcamp-363212")

,user_id,birth_year,country,city,created_date,user_settings_crypto_unlocked,plan,attributes_notifications_marketing_push,attributes_notifications_marketing_email,num_contacts,num_referrals,num_successful_referrals
0,user_2811,1988,IE,C,2018-03-04 21:46:39.616834+00:00,0,STANDARD,NaN,NaN,0,0,0
1,user_4750,1987,FR,Ry,2018-04-07 06:49:18.345736+00:00,0,STANDARD,NaN,NaN,0,0,0
2,user_17686,1984,GB,Ayr,2018-12-04 10:28:02.653147+00:00,0,PREMIUM,NaN,NaN,6,0,0
3,user_18779,1965,GB,Ayr,2018-12-31 07:42:19.353613+00:00,0,STANDARD,NaN,NaN,0,0,0
4,user_7823,1999,PL,Buk,2018-06-07 03:22:40.590209+00:00,0,STANDARD,NaN,NaN,0,0,0

In [52]:
df_users.shape

(19430, 12)

In [53]:
df_users.info() # two columns with missing values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19430 entries, 0 to 19429
Data columns (total 12 columns):
 #   Column                                    Non-Null Count  Dtype
---  ------                                    --------------  -----
 0   user_id                                   19430 non-null  object
 1   birth_year                                19430 non-null  Int64
 2   country                                   19430 non-null  object
 3   city                                      19430 non-null  object
 4   created_date                              19430 non-null  datetime64[us, UTC]
 5   user_settings_crypto_unlocked             19430 non-null  Int64
 6   plan                                      19430 non-null  object
 7   attributes_notifications_marketing_push   12820 non-null  float64
 8   attributes_notifications_marketing_email  12820 non-null  float64
 9   num_contacts                              19430 non-null  Int64
 10  num_referrals                             19430 non-null  Int64
 11  num_successful_referrals                  19430 non-null  Int64
dtypes: Int64(5), datetime64[us, UTC](1), float64(2), object(4)
memory usage: 1.9+ MB

In [54]:
# unicité primary key
df_users["user_id"].nunique(), df_users["user_id"].duplicated().sum()

(19430, np.int64(0))

In [55]:
df_users["user_id"].isna().sum()

np.int64(0)

In [56]:
(df_users.isna().mean()
 .sort_values(ascending=False)
 .head(15))

attributes_notifications_marketing_email    0.340196
attributes_notifications_marketing_push     0.340196
user_id                                     0.000000
birth_year                                  0.000000
city                                        0.000000
country                                     0.000000
user_settings_crypto_unlocked               0.000000
created_date                                0.000000
plan                                        0.000000
num_contacts                                0.000000
num_referrals                               0.000000
num_successful_referrals                    0.000000
dtype: float64

In [57]:
df_users["plan"].value_counts(dropna=False)

plan
STANDARD         17992
PREMIUM            865
METAL              507
METAL_FREE          37
PREMIUM_OFFER       25
PREMIUM_FREE         4
Name: count, dtype: int64

In [58]:
df_users["country"].value_counts(dropna=False).head(20)

country
GB    6315
PL    2306
FR    2110
IE    1214
RO    1096
ES     991
LT     646
PT     604
MT     548
DE     446
CH     443
CZ     355
IT     311
GR     218
CY     191
NL     174
LV     171
HU     157
BE     143
SE     141
Name: count, dtype: int64

In [59]:
df_users["created_date"].min(), df_users["created_date"].max()

(Timestamp('2018-01-01 08:42:24.799709+0000', tz='UTC'),
 Timestamp('2019-01-03 07:34:36.638892+0000', tz='UTC'))

CLEANING Neo_bank Table USERS

In [60]:
#check name columns

In [61]:
df_users.columns

Index(['user_id', 'birth_year', 'country', 'city', 'created_date',
       'user_settings_crypto_unlocked', 'plan',
       'attributes_notifications_marketing_push',
       'attributes_notifications_marketing_email', 'num_contacts',
       'num_referrals', 'num_successful_referrals'],
      dtype='object')

In [62]:
# check plan values

In [63]:
df_users["plan"].value_counts(dropna=False)

plan
STANDARD         17992
PREMIUM            865
METAL              507
METAL_FREE          37
PREMIUM_OFFER       25
PREMIUM_FREE         4
Name: count, dtype: int64

In [64]:
# check "country"

In [65]:
df_users["country"].value_counts(dropna=False).head(30)

country
GB    6315
PL    2306
FR    2110
IE    1214
RO    1096
ES     991
LT     646
PT     604
MT     548
DE     446
CH     443
CZ     355
IT     311
GR     218
CY     191
NL     174
LV     171
HU     157
BE     143
SE     141
DK     101
BG      94
NO      87
SI      87
SK      79
AT      78
HR      63
JE      55
GI      44
FI      38
Name: count, dtype: int64

In [66]:
#standardisation "country" just in case

In [67]:
df_users["country"] = df_users["country"].astype(str).str.strip().str.upper()

In [68]:
#clean "city"

In [69]:
df_users["city"] = (df_users["city"].astype(str).str.strip().str.title())

In [70]:
df_users["city"].value_counts().tail(20)

city
Trowbridge      1
Traunstein      1
Port De Bouc    1
Derendingen     1
Fjellstrand     1
Fos Sur Mer     1
Fredrikstad     1
Goczałków       1
Holmestrand     1
Jönköping       1
St-Maurice      1
Kopřivnice      1
Le Vésinet      1
Michelbouch     1
Riegelsberg     1
Siekierczyn     1
Zauggenried     1
Regensburg      1
Romanshorn      1
Kgs. Lyngby     1
Name: count, dtype: int64

In [71]:
df_users[df_users["city"].str.contains(r"\d", na=False)]["city"].value_counts().head(20)

city
Dublin 15    11
Dublin 7      8
Dublin 16     7
Dublin 3      7
Dublin 1      6
Praha 10      6
Dublin 14     6
Dublin 12     4
Dublin 5      4
Dublin 6      4
Dublin 8      4
Dublin 9      4
Praha 8       4
Prague 6      3
Dublin 18     3
Dublin 2      3
Praha 3       3
Dublin 4      3
Praha 5       3
Praha 6       3
Name: count, dtype: int64

In [72]:
#Remove the number at the end

In [73]:
df_users["city_clean"] = (
    df_users["city"]
    .astype(str)
    .str.strip()
    .str.title()
    .str.replace(r"\s+\d+$", "", regex=True)
)

In [74]:
df_users[df_users["city_clean"].str.contains(r"\d", na=False)]["city_clean"].value_counts().head(20)

city_clean
1120                     1
3000                     1
75011                    1
75018                    1
77340                    1
83219                    1
92300                    1
97233                    1
1050 Wien                1
37000 Tours              1
8810 Horgen              1
8008 Zürich              1
Praha 4-Krč              1
6845 Hohenems            1
Poznan 61-058            1
1000 Bruxelles           1
67433 Neustadt           1
79312 Emmendingen        1
Praha 5 - Zbraslav       1
95280 Jouy Le Moutier    1
Name: count, dtype: int64

In [75]:
df_users["city_clean"] = (
    df_users["city"]
    .astype(str)
    .str.strip()
    .str.title()
    .str.replace(r"^\d+\s*", "", regex=True)  # Remove numbers at the beginning
    .str.replace(r"\s+\d+$", "", regex=True)  # Removes numbers at the end
)

In [76]:
import re

def clean_city(city):
    if pd.isna(city):
        return city

    city = str(city)

    # remove postal codes like 61-058 or -300
    city = re.sub(r'\b\d{2}-\d{3}\b', '', city)
    city = re.sub(r'^-?\d+\s*', '', city)

    return city.strip()

df_users['city_clean'] = df_users['city_clean'].apply(clean_city)

In [77]:
df_users['city_clean'] = df_users['city_clean'].str.replace(r'\s\d+[A-Za-z]*$', '', regex=True)

In [78]:
df_users['city_clean'] = (
    df_users['city_clean']
    .str.strip()
    .str.title()
)

In [79]:
df_users['city_clean'] = (
    df_users['city_clean']
    .str.replace(r'\d+', '', regex=True)
    .str.replace(r'\s+', ' ', regex=True) # clean extra spaces
    .str.strip()
)

In [80]:
df_users.head(20)

,user_id,birth_year,country,city,created_date,user_settings_crypto_unlocked,plan,attributes_notifications_marketing_push,attributes_notifications_marketing_email,num_contacts,num_referrals,num_successful_referrals,city_clean
0,user_2811,1988,IE,C,2018-03-04 21:46:39.616834+00:00,0,STANDARD,NaN,NaN,0,0,0,C
1,user_4750,1987,FR,Ry,2018-04-07 06:49:18.345736+00:00,0,STANDARD,NaN,NaN,0,0,0,Ry
2,user_17686,1984,GB,Ayr,2018-12-04 10:28:02.653147+00:00,0,PREMIUM,NaN,NaN,6,0,0,Ayr
3,user_18779,1965,GB,Ayr,2018-12-31 07:42:19.353613+00:00,0,STANDARD,NaN,NaN,0,0,0,Ayr
4,user_7823,1999,PL,Buk,2018-06-07 03:22:40.590209+00:00,0,STANDARD,NaN,NaN,0,0,0,Buk
5,user_17106,1988,FR,Gex,2018-12-18 19:57:30.336579+00:00,0,STANDARD,NaN,NaN,13,0,0,Gex
6,user_19355,1991,ES,Ibi,2018-12-21 22:45:47.392445+00:00,0,STANDARD,NaN,NaN,12,0,0,Ibi
7,user_12113,1968,NO,Lye,2018-09-26 13:48:09.075591+00:00,0,STANDARD,NaN,NaN,2,0,0,Lye
8,user_17075,1966,FR,Pau,2018-12-27 04:06:05.375980+00:00,0,STANDARD,NaN,NaN,3,0,0,Pau
9,user_5056,1961,GB,Rye,2018-05-16 09:55:49.292006+00:00,0,STANDARD,NaN,NaN,10,0,0,Rye
10,user_6983,1968,BE,1120,2018-06-09 18:44:47.326065+00:00,0,STANDARD,NaN,NaN,0,0,0,
11,user_15320,1974,SI,3000,2018-11-02 04:43:32.728016+00:00,0,STANDARD,NaN,NaN,8,0,0,
12,user_18915,1991,IT,Alba,2018-12-23 11:50:40.512196+00:00,0,STANDARD,NaN,NaN,0,0,0,Alba
13,user_12595,1963,FR,Albi,2018-09-15 03:28:46.874410+00:00,0,STANDARD,NaN,NaN,4,0,0,Albi
14,user_13542,1958,RO,Arad,2018-10-20 06:30:19.610419+00:00,0,STANDARD,NaN,NaN,29,0,0,Arad
15,user_15731,1986,RO,Arad,2018-11-27 01:52:19.561522+00:00,0,STANDARD,NaN,NaN,7,0,0,Arad
16,user_16660,1984,RO,Arad,2018-11-24 14:41:54.174794+00:00,0,STANDARD,NaN,NaN,21,0,0,Arad
17,user_17932,1964,RO,Arad,2018-12-25 09:50:46.712224+00:00,0,STANDARD,NaN,NaN,4,0,0,Arad
18,user_16203,1987,IE,Bray,2018-11-02 19:31:05.585259+00:00,0,STANDARD,NaN,NaN,25,0,0,Bray
19,user_5795,1989,CH,Baar,2018-05-27 02:50:27.325051+00:00,0,STANDARD,NaN,NaN,0,0,0,Baar

In [81]:
#check city_clean column

In [82]:
df_users[df_users["city_clean"].str.contains(r"\d", na=False)]["city_clean"].value_counts().head(30) # all numbers were removed from the "city_clean" column

Series([], Name: count, dtype: int64)

In [83]:
df_users[df_users["city_clean"].str.len() <= 2]["city_clean"].value_counts().head(30) # Identify very short or empty city vaues after cleaning

city_clean
      29
C      1
Ry     1
Ig     1
Ay     1
Dt     1
Os     1
D      1
Ål     1
Name: count, dtype: int64

In [84]:
import numpy as np

# 1) Clean whitespace and handle string "nan" values
df_users["city_clean"] = (
    df_users["city_clean"]
    .astype(str)              # ensure column is string type
    .str.strip()              # remove leading/trailing spaces
    .replace(["", "nan", "Nan", "None", "NaN"], np.nan)  # replace empty or invalid strings with NaN
)

# 2) Replace missing values with "Unknown"
df_users["city_clean"] = df_users["city_clean"].fillna("Unknown")

# 3) Replace very short city names (<= 2 characters) with "Unknown"
df_users.loc[df_users["city_clean"].str.len() <= 2, "city_clean"] = "Unknown"

In [85]:
df_users[df_users["city_clean"].str.len() <= 2]["city_clean"].value_counts().head(20)

Series([], Name: count, dtype: int64)

In [86]:
df_users["city_clean"].isna().sum()

np.int64(0)

Missing values "attributes_notifications_marketing_push" and "attributes_notifications_marketing_email"

In [87]:
df_users["attributes_notifications_marketing_push"].value_counts(dropna=False).head(20)

attributes_notifications_marketing_push
1.0    12148
NaN     6610
0.0      672
Name: count, dtype: int64

In [88]:
df_users["attributes_notifications_marketing_email"].value_counts(dropna=False).head(20)

attributes_notifications_marketing_email
1.0    11486
NaN     6610
0.0     1334
Name: count, dtype: int64

In [89]:
print(df_users['attributes_notifications_marketing_push'].unique())
print(df_users['attributes_notifications_marketing_push'].dtype)

[nan  1.  0.]
float64

Marketing notification columns: standardization into three categories Yes / No / Not Informed

In [90]:
cols = [
    "attributes_notifications_marketing_push",
    "attributes_notifications_marketing_email"
]

df_users[cols] = df_users[cols].fillna("Not Informed")

In [91]:
df_users.head()

,user_id,birth_year,country,city,created_date,user_settings_crypto_unlocked,plan,attributes_notifications_marketing_push,attributes_notifications_marketing_email,num_contacts,num_referrals,num_successful_referrals,city_clean
0,user_2811,1988,IE,C,2018-03-04 21:46:39.616834+00:00,0,STANDARD,Not Informed,Not Informed,0,0,0,Unknown
1,user_4750,1987,FR,Ry,2018-04-07 06:49:18.345736+00:00,0,STANDARD,Not Informed,Not Informed,0,0,0,Unknown
2,user_17686,1984,GB,Ayr,2018-12-04 10:28:02.653147+00:00,0,PREMIUM,Not Informed,Not Informed,6,0,0,Ayr
3,user_18779,1965,GB,Ayr,2018-12-31 07:42:19.353613+00:00,0,STANDARD,Not Informed,Not Informed,0,0,0,Ayr
4,user_7823,1999,PL,Buk,2018-06-07 03:22:40.590209+00:00,0,STANDARD,Not Informed,Not Informed,0,0,0,Buk

In [92]:
#Changes 1.0 to "Yes" and 0.0 to "No"

In [93]:
cols = [
    "attributes_notifications_marketing_push",
    "attributes_notifications_marketing_email"
]

df_users[cols] = df_users[cols].replace({1.0: "Yes", 0.0: "No"})

In [94]:
#check the values of the 2 columns: "attributes_notifications_marketing_push" and "attributes_notifications_marketing_email"

In [95]:
print(df_users['attributes_notifications_marketing_push'].unique())
print(df_users['attributes_notifications_marketing_push'].dtype)

['Not Informed' 'Yes' 'No']
object

In [96]:
df_users["attributes_notifications_marketing_push"].value_counts(dropna=False)

attributes_notifications_marketing_push
Yes             12148
Not Informed     6610
No                672
Name: count, dtype: int64

In [97]:
df_users["attributes_notifications_marketing_email"].value_counts(dropna=False)

attributes_notifications_marketing_email
Yes             11486
Not Informed     6610
No               1334
Name: count, dtype: int64

Check after cleaning

In [98]:
df_users.shape

(19430, 13)

In [99]:
df_users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19430 entries, 0 to 19429
Data columns (total 13 columns):
 #   Column                                    Non-Null Count  Dtype
---  ------                                    --------------  -----
 0   user_id                                   19430 non-null  object
 1   birth_year                                19430 non-null  Int64
 2   country                                   19430 non-null  object
 3   city                                      19430 non-null  object
 4   created_date                              19430 non-null  datetime64[us, UTC]
 5   user_settings_crypto_unlocked             19430 non-null  Int64
 6   plan                                      19430 non-null  object
 7   attributes_notifications_marketing_push   19430 non-null  object
 8   attributes_notifications_marketing_email  19430 non-null  object
 9   num_contacts                              19430 non-null  Int64
 10  num_referrals                             19430 non-null  Int64
 11  num_successful_referrals                  19430 non-null  Int64
 12  city_clean                                19430 non-null  object
dtypes: Int64(5), datetime64[us, UTC](1), object(7)
memory usage: 2.0+ MB

In [100]:
df_users.isna().sum(),df_users.duplicated(subset="user_id").sum()

(user_id                                     0
 birth_year                                  0
 country                                     0
 city                                        0
 created_date                                0
 user_settings_crypto_unlocked               0
 plan                                        0
 attributes_notifications_marketing_push     0
 attributes_notifications_marketing_email    0
 num_contacts                                0
 num_referrals                               0
 num_successful_referrals                    0
 city_clean                                  0
 dtype: int64,
 np.int64(0))